In [1]:
import pandas as pd

In [2]:
import numpy as np

In [3]:
s = pd.Series([1,3,5,np.nan,6.8])

In [4]:
print(s)

0    1.0
1    3.0
2    5.0
3    NaN
4    6.8
dtype: float64

In [5]:
dates = pd.date_range('20130101', periods=6)

In [6]:
dates

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [10]:
df = pd.DataFrame(np.random.randn(6,4), index=dates, columns = ['A','B','C','D'])

In [11]:
df

                   A         B         C         D
2013-01-01  0.137058  0.061820 -0.678012  0.716186
2013-01-02  0.102173  0.772759 -0.888406  1.714024
2013-01-03  1.324195 -0.093955 -0.185601  0.151394
2013-01-04 -0.082200  0.437899  0.920031  0.111101
2013-01-05 -0.663633  0.079194  0.731886  1.711126
2013-01-06  1.696161 -0.020758  0.429035 -0.509343

In [12]:
df.head()

                   A         B         C         D
2013-01-01  0.137058  0.061820 -0.678012  0.716186
2013-01-02  0.102173  0.772759 -0.888406  1.714024
2013-01-03  1.324195 -0.093955 -0.185601  0.151394
2013-01-04 -0.082200  0.437899  0.920031  0.111101
2013-01-05 -0.663633  0.079194  0.731886  1.711126

In [13]:
df.head(3)

                   A         B         C         D
2013-01-01  0.137058  0.061820 -0.678012  0.716186
2013-01-02  0.102173  0.772759 -0.888406  1.714024
2013-01-03  1.324195 -0.093955 -0.185601  0.151394

In [14]:
df.index

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [15]:
df.columns

Index(['A', 'B', 'C', 'D'], dtype='object')

In [16]:
df.values

array([[ 0.13705827,  0.06181957, -0.67801163,  0.71618593],
       [ 0.10217282,  0.77275909, -0.88840643,  1.71402352],
       [ 1.3241952 , -0.0939552 , -0.18560054,  0.15139448],
       [-0.08219996,  0.43789907,  0.92003125,  0.11110079],
       [-0.66363257,  0.07919424,  0.73188605,  1.71112622],
       [ 1.69616133, -0.02075753,  0.42903508, -0.50934335]])

In [17]:
df.info()

<class 'pandas.core.frame.DataFrame'>
DatetimeIndex: 6 entries, 2013-01-01 to 2013-01-06
Freq: D
Data columns (total 4 columns):
A    6 non-null float64
B    6 non-null float64
C    6 non-null float64
D    6 non-null float64
dtypes: float64(4)
memory usage: 240.0 bytes

In [18]:
df.describe()

              A         B         C         D
count  6.000000  6.000000  6.000000  6.000000
mean   0.418959  0.206160  0.054822  0.649081
std    0.900409  0.332642  0.752538  0.910561
min   -0.663633 -0.093955 -0.888406 -0.509343
25%   -0.036107 -0.000113 -0.554909  0.121174
50%    0.119616  0.070507  0.121717  0.433790
75%    1.027411  0.348223  0.656173  1.462391
max    1.696161  0.772759  0.920031  1.714024

In [19]:
df.sort_values(by='B', ascending=False)

                   A         B         C         D
2013-01-02  0.102173  0.772759 -0.888406  1.714024
2013-01-04 -0.082200  0.437899  0.920031  0.111101
2013-01-05 -0.663633  0.079194  0.731886  1.711126
2013-01-01  0.137058  0.061820 -0.678012  0.716186
2013-01-06  1.696161 -0.020758  0.429035 -0.509343
2013-01-03  1.324195 -0.093955 -0.185601  0.151394

In [20]:
df.loc[dates[0]]

A    0.137058
B    0.061820
C   -0.678012
D    0.716186
Name: 2013-01-01 00:00:00, dtype: float64

In [21]:
df.loc[:,['A','B']]

                   A         B
2013-01-01  0.137058  0.061820
2013-01-02  0.102173  0.772759
2013-01-03  1.324195 -0.093955
2013-01-04 -0.082200  0.437899
2013-01-05 -0.663633  0.079194
2013-01-06  1.696161 -0.020758

In [22]:
df.loc['20130102':'20130104',['A', 'B']]

                   A         B
2013-01-02  0.102173  0.772759
2013-01-03  1.324195 -0.093955
2013-01-04 -0.082200  0.437899

In [23]:
df.loc['20130102',['A','B']]

A    0.102173
B    0.772759
Name: 2013-01-02 00:00:00, dtype: float64

In [24]:
df.loc[dates[0],'A']

0.13705827049462502

In [25]:
df.iloc[3]

A   -0.082200
B    0.437899
C    0.920031
D    0.111101
Name: 2013-01-04 00:00:00, dtype: float64

In [26]:
df.iloc[3:5, 0:2]

                   A         B
2013-01-04 -0.082200  0.437899
2013-01-05 -0.663633  0.079194

In [27]:
df.iloc[[1,2,4], [0,2]]

                   A         C
2013-01-02  0.102173 -0.888406
2013-01-03  1.324195 -0.185601
2013-01-05 -0.663633  0.731886

In [28]:
df.iloc[1:3, :]

                   A         B         C         D
2013-01-02  0.102173  0.772759 -0.888406  1.714024
2013-01-03  1.324195 -0.093955 -0.185601  0.151394

In [29]:
df.iloc[:, 1:3]

                   B         C
2013-01-01  0.061820 -0.678012
2013-01-02  0.772759 -0.888406
2013-01-03 -0.093955 -0.185601
2013-01-04  0.437899  0.920031
2013-01-05  0.079194  0.731886
2013-01-06 -0.020758  0.429035

In [30]:
df[df.A > 0]

                   A         B         C         D
2013-01-01  0.137058  0.061820 -0.678012  0.716186
2013-01-02  0.102173  0.772759 -0.888406  1.714024
2013-01-03  1.324195 -0.093955 -0.185601  0.151394
2013-01-06  1.696161 -0.020758  0.429035 -0.509343

In [31]:
df

                   A         B         C         D
2013-01-01  0.137058  0.061820 -0.678012  0.716186
2013-01-02  0.102173  0.772759 -0.888406  1.714024
2013-01-03  1.324195 -0.093955 -0.185601  0.151394
2013-01-04 -0.082200  0.437899  0.920031  0.111101
2013-01-05 -0.663633  0.079194  0.731886  1.711126
2013-01-06  1.696161 -0.020758  0.429035 -0.509343

In [32]:
df[df > 0]

                   A         B         C         D
2013-01-01  0.137058  0.061820       NaN  0.716186
2013-01-02  0.102173  0.772759       NaN  1.714024
2013-01-03  1.324195       NaN       NaN  0.151394
2013-01-04       NaN  0.437899  0.920031  0.111101
2013-01-05       NaN  0.079194  0.731886  1.711126
2013-01-06  1.696161       NaN  0.429035       NaN

In [33]:
df2 = df.copy()

In [34]:
df2['E']= ['one', 'one', 
          'two', 'three', 'four', 'three']

In [35]:
df2

                   A         B         C         D      E
2013-01-01  0.137058  0.061820 -0.678012  0.716186    one
2013-01-02  0.102173  0.772759 -0.888406  1.714024    one
2013-01-03  1.324195 -0.093955 -0.185601  0.151394    two
2013-01-04 -0.082200  0.437899  0.920031  0.111101  three
2013-01-05 -0.663633  0.079194  0.731886  1.711126   four
2013-01-06  1.696161 -0.020758  0.429035 -0.509343  three

In [36]:
df2['E'].isin(['two', 'four'])

2013-01-01    False
2013-01-02    False
2013-01-03     True
2013-01-04    False
2013-01-05     True
2013-01-06    False
Freq: D, Name: E, dtype: bool

In [37]:
df.apply(np.cumsum)

                   A         B         C         D
2013-01-01  0.137058  0.061820 -0.678012  0.716186
2013-01-02  0.239231  0.834579 -1.566418  2.430209
2013-01-03  1.563426  0.740623 -1.752019  2.581604
2013-01-04  1.481226  1.178523 -0.831987  2.692705
2013-01-05  0.817594  1.257717 -0.100101  4.403831
2013-01-06  2.513755  1.236959  0.328934  3.894488

In [38]:
df

                   A         B         C         D
2013-01-01  0.137058  0.061820 -0.678012  0.716186
2013-01-02  0.102173  0.772759 -0.888406  1.714024
2013-01-03  1.324195 -0.093955 -0.185601  0.151394
2013-01-04 -0.082200  0.437899  0.920031  0.111101
2013-01-05 -0.663633  0.079194  0.731886  1.711126
2013-01-06  1.696161 -0.020758  0.429035 -0.509343

In [39]:
df.apply(lambda x: x.max() - x.min())

A    2.359794
B    0.866714
C    1.808438
D    2.223367
dtype: float64

In [41]:
df1 = pd.DataFrame({'A': ['A0', 'A1', 'A2', 'A3'],
                   'B': ['B0', 'B1', 'B2', 'B3'],
                   'C': ['C0', 'C1', 'C2', 'C3'],
                   'D': ['D0', 'D1', 'D2', 'D3']},
                      index=[0, 1, 2, 3])

In [42]:
df1

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3

In [45]:
df2 = pd.DataFrame({'A':['A4','A5','A6','A7'],
                   'B':['B4', 'B5', 'B6', 'B7'],
                   'C':['C4', 'C5', 'C6', 'C7'],
                   'D':['D4', 'D5', 'D6', 'D7']},
                     index=[4,5,6,7])

In [46]:
df2

    A   B   C   D
4  A4  B4  C4  D4
5  A5  B5  C5  D5
6  A6  B6  C6  D6
7  A7  B7  C7  D7

In [51]:
df3 = pd.DataFrame({'A': ['A8', 'A9', 'A10', 'A11'],
                   'B': ['B8', 'B9', 'B10', 'B11'],
                   'C': ['C8', 'C9', 'C10', 'C11'],
                   'D': ['D8', 'D9', 'D10', 'D11']},
                  index = [8, 9, 10, 11])

In [52]:
result = pd.concat([df1, df2, df3])

In [53]:
result

      A    B    C    D
0    A0   B0   C0   D0
1    A1   B1   C1   D1
2    A2   B2   C2   D2
3    A3   B3   C3   D3
4    A4   B4   C4   D4
5    A5   B5   C5   D5
6    A6   B6   C6   D6
7    A7   B7   C7   D7
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

In [54]:
result = pd.concat([df1, df2, df3], keys=['x', 'y', 'z'])

In [55]:
result

        A    B    C    D
x 0    A0   B0   C0   D0
  1    A1   B1   C1   D1
  2    A2   B2   C2   D2
  3    A3   B3   C3   D3
y 4    A4   B4   C4   D4
  5    A5   B5   C5   D5
  6    A6   B6   C6   D6
  7    A7   B7   C7   D7
z 8    A8   B8   C8   D8
  9    A9   B9   C9   D9
  10  A10  B10  C10  D10
  11  A11  B11  C11  D11

In [56]:
result.index

MultiIndex(levels=[['x', 'y', 'z'], [0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11]],
           codes=[[0, 0, 0, 0, 1, 1, 1, 1, 2, 2, 2, 2], [0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11]])

In [57]:
result.index.get_level_values(0)

Index(['x', 'x', 'x', 'x', 'y', 'y', 'y', 'y', 'z', 'z', 'z', 'z'], dtype='object')

In [58]:
result.index.get_level_values(1)

Int64Index([0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11], dtype='int64')

In [59]:
result

        A    B    C    D
x 0    A0   B0   C0   D0
  1    A1   B1   C1   D1
  2    A2   B2   C2   D2
  3    A3   B3   C3   D3
y 4    A4   B4   C4   D4
  5    A5   B5   C5   D5
  6    A6   B6   C6   D6
  7    A7   B7   C7   D7
z 8    A8   B8   C8   D8
  9    A9   B9   C9   D9
  10  A10  B10  C10  D10
  11  A11  B11  C11  D11

In [61]:
df4 = pd.DataFrame({'B': ['B2', 'B3', 'B6', 'B7'],
                  'D': ['D2', 'D3', 'D6', 'D7'],
                    'F': ['F2', 'F3', 'F6', 'F7']},
                    index = [2, 3, 6, 7])

In [62]:
result = pd.concat([df1, df4], axis = 1)

In [63]:
df1

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3

In [64]:
df4

    B   D   F
2  B2  D2  F2
3  B3  D3  F3
6  B6  D6  F6
7  B7  D7  F7

In [65]:
result

     A    B    C    D    B    D    F
0   A0   B0   C0   D0  NaN  NaN  NaN
1   A1   B1   C1   D1  NaN  NaN  NaN
2   A2   B2   C2   D2   B2   D2   F2
3   A3   B3   C3   D3   B3   D3   F3
6  NaN  NaN  NaN  NaN   B6   D6   F6
7  NaN  NaN  NaN  NaN   B7   D7   F7

In [66]:
result = pd.concat([df1, df4], axis = 1, join = 'inner')

In [68]:
result

    A   B   C   D   B   D   F
2  A2  B2  C2  D2  B2  D2  F2
3  A3  B3  C3  D3  B3  D3  F3

In [69]:
result = pd.concat([df1, df4], axis = 1, join_axes=[df1.index])

In [70]:
result

    A   B   C   D    B    D    F
0  A0  B0  C0  D0  NaN  NaN  NaN
1  A1  B1  C1  D1  NaN  NaN  NaN
2  A2  B2  C2  D2   B2   D2   F2
3  A3  B3  C3  D3   B3   D3   F3

In [71]:
result = pd.concat([df1, df4], ignore_index = True)

C:\Users\user\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: FutureWarning: Sorting because non-concatenation axis is not aligned. A future version
of pandas will change to not sort by default.

To accept the future behavior, pass 'sort=False'.

To retain the current behavior and silence the warning, pass 'sort=True'.

  """Entry point for launching an IPython kernel.

In [72]:
result

     A   B    C   D    F
0   A0  B0   C0  D0  NaN
1   A1  B1   C1  D1  NaN
2   A2  B2   C2  D2  NaN
3   A3  B3   C3  D3  NaN
4  NaN  B2  NaN  D2   F2
5  NaN  B3  NaN  D3   F3
6  NaN  B6  NaN  D6   F6
7  NaN  B7  NaN  D7   F7

In [73]:
left = pd.DataFrame({'key': ['K0', 'K4', 'K2', 'K3'],
                    'A': ['A0', 'A1', 'A2', 'A3'],
                    'B':['B0', 'B1', 'B2', 'B3']})

In [75]:
right = pd.DataFrame({'key': ['K0', 'K1', 'K2', 'K3'],
                     'C': ['C0', 'C1', 'C2', 'C3'],
                     'D': ['D0', 'D1', 'D2', 'D3']})

In [76]:
pd.merge(left, right, on='key')

  key   A   B   C   D
0  K0  A0  B0  C0  D0
1  K2  A2  B2  C2  D2
2  K3  A3  B3  C3  D3

In [77]:
pd.merge(left, right, how='left', on='key')

  key   A   B    C    D
0  K0  A0  B0   C0   D0
1  K4  A1  B1  NaN  NaN
2  K2  A2  B2   C2   D2
3  K3  A3  B3   C3   D3

In [78]:
pd.merge(left, right, how='right', on='key')

  key    A    B   C   D
0  K0   A0   B0  C0  D0
1  K2   A2   B2  C2  D2
2  K3   A3   B3  C3  D3
3  K1  NaN  NaN  C1  D1

In [79]:
pd.merge(left, right, how='outer', on='key')

  key    A    B    C    D
0  K0   A0   B0   C0   D0
1  K4   A1   B1  NaN  NaN
2  K2   A2   B2   C2   D2
3  K3   A3   B3   C3   D3
4  K1  NaN  NaN   C1   D1